//: Playground - noun: a place where people can play

import UIKit

/*
 Какво е playground? 
 
 Това вид проект, който се изпозлва от xCode. Интерактивно показва какво е състоянието на паметта на компютъра във всеки един ред на изпълнение на код-а. Позволява лесно онагледяване на примерния код. Много по лесно може да се анализира кода. Можем да скицираме проблеми и техните решения, които да използваме за напред.
 
 */



// Лекция 2
// курс: Увод в прогрмаирането със Swift

//коментар на един ред

/*
 коментар
 на
 няколко
 реда
 */

let zeroValue = 1

var integerValue = 42

//декларираме по няколко променливи
var x = 0, y = 5

//декларираме по няколко константи
let a = 1, b = 3

/*
 
 Добра практика:
 
 По-прегледно е да декларираме по една променлива или константа на ред, понеже кодът е по-четлив. Когато сме в Playground виждаме и съответната стойност, която стои в паметта.
 */


let `let` = 15
var `var` = 12


let variable1 = 123

let 😼 = "cat"
let котка = "😼"
/*
 
 Добра практика:
 
 Добре е кода на програмите да е написан на един език, който ще е разбираем от всички работещи над програмата. Хубаво е да се използва английски, но не е задължително. Пропръчително е дори коментарите да са на един език, за да може в последствие лесно да се разбира код-а на програмата.
 
 Интересно:
 
 Прогрманият код се пише, но по-често се чете. Такъв е случаят и с вашите домашни или проекти. Вие го пишете и четете. После проверяващите го четат, дори и вашите колеги и те си позволява да му хвърлят някой друг поглед. Всеки един програмист е творец, който твори програмен код.

*/

//Целочислен тип Int


//следват различните типове, поризводни на Int

var uint8:UInt8 = 18
uint8 = 0
//uint8 = -1 // грешка, понеже -1 е негативно число

var int32:Int32 = -35
uint8 = 32
//int32 = 32 + uint8 // грешка, понеже нямаме право да събираме различни типове, без да обявим начин за преминаване към общ тип
int32 = 32 + Int32(uint8)


//тип дробни числа
let pi:Float = 3.1415

let randomFloat = 5.121233

//ето как да проверим типа на променлива или константа
type(of:randomFloat)
type(of:pi)
type(of:int32)







